# SENTENCIA HALVING

a cláusula HAVING se utiliza en consultas SELECT para filtrar los resultados de una consulta que incluye agrupamientos de datos. Esta cláusula se aplica después de agrupar los resultados mediante la cláusula GROUP BY, y funciona de manera similar a la cláusula WHERE, pero aplicada a los resultados agrupados en lugar de a las filas individuales.

Por ejemplo, supongamos que tenemos una tabla sales con información sobre las ventas de una empresa, con las columnas salesperson, product y total. Podemos utilizar la cláusula HAVING para obtener una lista de los productos que han generado más de $1000 en ventas:

```sql
SELECT product, SUM(total) as total_sales
FROM sales
GROUP BY product
HAVING SUM(total) > 1000;
```

En este ejemplo, primero utilizamos la cláusula GROUP BY para agrupar los resultados por producto, y luego utilizamos la cláusula HAVING para filtrar los resultados y mostrar solo aquellos productos que han generado más de $1000 en ventas.

Espero que esta explicación te haya ayudado a entender cómo funciona la cláusula HAVING en SQL. Si tienes alguna pregunta más, no dudes en preguntar.

  <a href="https://sqliteonline.com/" target="_blank"><button type="button" class="btn btn-success">
  <a href="https://sqliteonline.com/" target="_blank" style="color: white; text-decoration:none;">SQL online</a>
</button></a>

In [1]:
#Iniciar SQLite
%load_ext sql
%sql sqlite://

# Paso 1 crearemos la báse de datos.

In [2]:
%%sql
CREATE TABLE exercise_logs
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    minutes INTEGER, 
    calories INTEGER,
    heart_rate INTEGER);

INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("biking", 30, 115, 110);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("biking", 10, 45, 105);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("dancing", 15, 200, 120);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("dancing", 15, 165, 120);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("tree climbing", 30, 70, 90);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("tree climbing", 25, 72, 80);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("rowing", 30, 70, 90);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("hiking", 60, 80, 85);

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
SELECT * FROM exercise_logs;

 * sqlite://
Done.

[(1, 'biking', 30, 115, 110),
 (2, 'biking', 10, 45, 105),
 (3, 'dancing', 15, 200, 120),
 (4, 'dancing', 15, 165, 120),
 (5, 'tree climbing', 30, 70, 90),
 (6, 'tree climbing', 25, 72, 80),
 (7, 'rowing', 30, 70, 90),
 (8, 'hiking', 60, 80, 85)]

### Paso 1.1 : Agrupar la consulta con GROUP BY

In [6]:
%%sql
SELECt type, SUM(calories) FROM exercise_logs GROUP BY type;

 * sqlite://
Done.

[('biking', 160),
 ('dancing', 365),
 ('hiking', 80),
 ('rowing', 70),
 ('tree climbing', 142)]

### Paso 1.2 : Agrupar la consulta con GROUP BY

In [7]:
%%sql
SELECt type, SUM(calories) AS total_calories FROM exercise_logs GROUP BY type;

 * sqlite://
Done.

[('biking', 160),
 ('dancing', 365),
 ('hiking', 80),
 ('rowing', 70),
 ('tree climbing', 142)]

### Paso 1.3 : Agrupar la consulta con GROUP BY

In [8]:
%%sql
SELECT type, SUM(calories) AS total_calories FROM exercise_logs
    WHERE calories > 150
    GROUP BY type;

 * sqlite://
Done.

[('dancing', 365)]

#### Paso 1.4 : Agrupar la consulta con GROUP BY

In [9]:
%%sql
SELECT type, SUM(calories) AS total_calories FROM exercise_logs
    GROUP BY type
    HAVING total_calories > 150;

 * sqlite://
Done.

[('biking', 160), ('dancing', 365)]

# Paso 2 crearemos la báse de datos.

In [ ]:
%%sql
CREATE TABLE sales (
  salesperson TEXT,
  product TEXT,
  total REAL,
  year INTEGER
);

INSERT INTO sales (salesperson, product, total, year) VALUES
  ('John', 'Windows', 100, 2021),
  ('John', 'Windows', 75, 2022),
  ('John', 'Windows', 50, 2021),
  ('John', 'Office', 125, 2022),
  ('John', 'Office', 25, 2021),
  ('Mary', 'Windows', 75, 2022),
  ('Mary', 'Windows', 25, 2022),
  ('Mary', 'Office', 50, 2021),
  ('Mary', 'Office', 100, 2021),
  ('Mary', 'Office', 50, 2022),
  ('Kate', 'Windows', 25, 2021),
  ('Kate', 'Office', 50, 2022),
  ('Kate', 'Office', 100, 2021),
  ('Kate', 'Office', 75, 2022),
  ('Kate', 'Office', 25, 2021),
  ('Sam', 'Windows', 75, 2022),
  ('Sam', 'Windows', 25, 2022),
  ('Sam', 'Office', 50, 2021),
  ('Sam', 'Office', 100, 2021),
  ('Sam', 'Office', 50, 2022),
  ('Laura', 'Windows', 100, 2021),
  ('Laura', 'Windows', 75, 2022),
  ('Laura', 'Windows', 50, 2021),
  ('Laura', 'Office', 125, 2022),
  ('Laura', 'Office', 25, 2021),
  ('John', 'Excel', 100, 2021),
  ('John', 'Excel', 75, 2022),
  ('John', 'Excel', 50, 2021),
  ('John', 'Outlook', 125, 2022),
  ('John', 'Outlook', 25, 2021),
  ('Mary', 'Excel', 75, 2022),
  ('Mary', 'Excel', 25, 2022),
  ('Mary', 'Outlook', 50, 2021),
  ('Mary', 'Outlook', 100, 2021),
  ('Mary', 'Outlook', 50, 2022),
  ('Kate', 'Excel', 25, 2021),
  ('Kate', 'Outlook', 50, 2022),
  ('Kate', 'Outlook', 100, 2021),
  ('Kate', 'Outlook', 75, 2022),
  ('Kate', 'Outlook', 25, 2021),
  ('Sam', 'Excel', 75, 2022),
  ('Sam', 'Excel', 25, 2022),
  ('Sam', 'Outlook', 50, 2021),
  ('Sam', 'Outlook', 100, 2021),
  ('Sam', 'Outlook', 50, 2022),
  ('Laura', 'Excel', 100, 2021),
  ('Laura', 'Excel', 75, 2022);

# Actividad 1 : Ayuda a Microsoft 

Microsoft quiere extraer varios datos de sus ventas de los últimos años, lee los enunciados y comprende el ejercicio.

Obtener una lista de los vendedores que han realizado más de 3 ventas en el año 2021:

In [ ]:
%%sql
SELECT salesperson, COUNT(*) as num_sales
FROM sales
WHERE year = 2021
GROUP BY salesperson
HAVING COUNT(*) >= 3;

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Ejercicio 1: en clase.

Obtener una lista de los productos que han generado más de $50 en ventas en el año 2022:

In [ ]:
%%sql
SELECT product, SUM(total) as total_sales
FROM sales
WHERE year = 2022
GROUP BY product
HAVING SUM(total) > 400;

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Actividad 2:

Obtener una lista de los vendedores que han realizado ventas con un monto promedio superior a $75 en el año 2021:

In [ ]:
%%sql
SELECT salesperson, AVG(total) as avg_sales
FROM sales
WHERE year = 2021
GROUP BY salesperson
HAVING AVG(total) > 25;

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Ejercicio 2: en clase.

Obtener una lista de los vendedores que han realizado 2 o más ventas en el año 2021 para productos que han generado más de $100 en ventas:

In [ ]:
%%sql
SELECT salesperson, product, COUNT(*) as num_sales
FROM sales
WHERE year = 2022
GROUP BY salesperson, product
HAVING SUM(total) > 100 AND COUNT(*) > 1;

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">